class Translation(object):
    START_TEXT = """Hello നമസ്കാരം, ഞാൻ ഒരു Simple File Renamer Bot ആണ്. എനിക്ക് Permanent Thumbnail support ഉണ്ട്!💯

<b>എനിക്ക് ഏതെങ്കിലും ഒരു Telegram File Send ചെയ്യുക അതിന് Reply ആയി /rename NewName.extn എന്ന് തന്നാൽ ഞാൻ അത് Rename ചെയ്തു തരുന്നതായിരിക്കും.</b>"""

    RENAME_403_ERR = "എന്തുവാടെ കാണിക്കുന്നേ? നിന്നെ ഞാൻ ban ചെയ്തിരിക്കുന്നു"
    ABS_TEXT = "നീ എന്തോ ചെയ്യാൻ നോക്കുവാടെ?"
    UPGRADE_TEXT = "Contact: @KL35Palakaaran"
    DOWNLOAD_START = "ഞാൻ Download Start ചെയ്തിട്ടുണ്ട്. എനിക്ക് കുറച്ചു സമയം വേണം."
    UPLOAD_START = "ഹോ.. സമാധാനം Download ചെയ്ത് കഴിഞ്ഞു ഇനി Upload ചെയ്യണം"
    RCHD_TG_API_LIMIT = "നീ കണ്ടോ ഞാൻ {} സെക്കന്റിൽ Download ചെയ്തു.\nFile Size ഞാൻ കണ്ടുപിടിച്ചു: {}\nSorry നീ എന്തുവാ വിചാരിച്ചേ! ഞാൻ ഇപ്പോൾ Upload ചെയ്യും?"
    AFTER_SUCCESSFUL_UPLOAD_MSG = "**Rename ചെയ്യാൻ എന്നെ ഉപയോഗിച്ചതിന് നന്ദി അളിയാ, നന്ദി > ©  @KL35Palakaaran **"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "നീ കണ്ടോ ഞാൻ {} സെക്കന്റിൽ Download ചെയ്തു.\nഎന്നിട്ട് {} സെക്കന്റിൽ Upload ചെയ്തു"
    NOT_AUTH_USER_TEXT = "Contact @KL35Palakaaran"
    NOT_AUTH_USER_TEXT_FILE_SIZE = "ഈ മെസ്സേജ് നിനക്ക് കിട്ടിയെങ്കിൽ നീ @KL35Palakaaran മുതലാളിയെ Contact ചെയ്യണം."
    SAVED_CUSTOM_THUMB_NAIL = "ഞാൻ Custom Thumbnail Save ചെയ്തു ✅. ഈ Thumbnail ആയിരിക്കും ഇനി മുതൽ ഉള്ള എല്ലാ ഫയലുകൾക്കും ഞാൻ Use ചെയ്യുക."
    DEL_ETED_CUSTOM_THUMB_NAIL = "ഞാൻ Custom Thumbnail Delete ചെയ്തു ❎️. ഇനി Thumbnail താരത്തെ അയക്കുന്ന ഫയലുകൾക്ക് Thumbnail കാണില്ല."
    FF_MPEG_DEL_ETED_CUSTOM_MEDIA = "Media ഞാൻ മൊത്തത്തിൽ അങ്ങ് കളഞ്ഞു."
    SAVED_RECVD_DOC_FILE = "ഞാൻ File Download ചെയ്തു കഴിഞ്ഞു😎"
    CUSTOM_CAPTION_UL_FILE = " "
    NO_CUSTOM_THUMB_NAIL_FOUND = "നീ എനിക്ക് Custom Thumbnail ഒന്നും തന്നില്ല. കഷ്ടം"
    USER_ADDED_TO_DB = "User <a href='tg://user?id={}'>{}</a> added to {} till {}."
    KL35_THUMBNAIL_PHOTO = "https://telegra.ph/file/0b4e6202434fec2b29046.jpg"
    HELP_USER = """ഇത് അത്രക്ക് പാടൊന്നുമല്ലടെ.
    
1. ഒരു Telegram File Send ചെയ്യുക.
2. Thumbnail തരുക.(നീ ഒരു പ്രാവശ്യം തന്നാൽ മതി)
3. ആ ഫയലിന് Reply ആയി /rename NewName.Extension എന്ന് തരുക."""

